{
  "app.tools.arabic.keyboard.title": "لوحة مفاتيح عربية",
  "app.tools.arabic.keyboard.done": "تم",
  "app.tools.arabic.keyboard.placeholder": "انقر على حرف لإضافته هنا",
  "app.tools.arabic.keyboard.space": "فراغ",
  "app.help.link.label": "Help",
  "app.titles.gist.see.full.record": "انظر السجل الكامل",
  "app.about.page.title": "حول",
  "app.about.title": "ماهو برنامج ال AMMS؟",
  "app.about.subtitle": "[مشروع المخطوطات العربية فى غرب افريقيا]",
  "app.about.content.p2": "وتتألف قاعدة البيانات من خمس مجموعات بيانات تفاعلية: سجلات المخطوطات، والمؤلفون، و النسبه أو الإسم القبلي للمؤلفين، والموضوعات، والمجموعات نفسها. ولها محرك بحث مصمم لتحديد المخطوطات والمؤلفين عندما تكون المعلومات المجزأة متاحة فقط، باللغات العربية أو اللاتينية. ويجري حاليا الربط التجريبي للصور الرقمية للنصوص المخطوطة مع السجلات.",
  "app.about.content.p3": "قاعدة البيانات وأداة الإدخال الفهرسة متاحة للجمهور دون أي تكلفة للمستخدمين. ويتم تشجيع القائمين على المخطوطات المهتمين باستخدام نظام الإدخال على الكتابة إلى المحررين لطلب الوصول إلى نماذج إدخال البيانات. وتغطي ثلاثون حقلا باللغتين العربية والإنكليزية جميع الواصفات المستخدمة عادة في أعمال المخطوطات، ونشجع على إدراج المواد المفهرسة حديثا في قاعدة البيانات الرئيسية؛ يرجى الاتصال المحررين.",
  "app.about.content.p4": "وقد قدم الصندوق الوطني للعلوم الإنسانية وجامعة إلينوي في إربانا- شامبين وجامعة جونز هوبكنز ومؤسسة الفرقان للتراث الإسلامي وجامعة دوك تمويلا لتطوير وتحسين نظام AMMS خلال السنوات ال 25 الماضية. للحصول على معلومات:",
  "app.about.content.charles2": "معهد الفكر الإسلامي في أفريقيا، جامعة نورث وسترن",
  "app.about.content.bruce2": "قسم التاريخ، جامعة كاليفورنيا، بيركلي",
  "app.about.content.p1": "هو قاعدة بيانات ثنائية اللغة و قد تم تطويرها من قبل جامعة ألينوي في أواخر 1980s لوصف مجموعة من المخطوطات العربية في جنوب موريتانيا (بوتيليميت). وفي وقت لاحق، تم إدخال سبع مجموعات أخرى من غرب أفريقيا، بما في ذلك مكتبات المخطوطات في المعهد الموريتاني للبحث العلمي، نواكشوط؛ جامعة نورث وسترن؛ القائمة الأصلية للمخطوطات في مستودع IHERIAB (مركز أحمد بابا) في تمبكتو؛ مكتبة الحاج عمر المحفوظة في المكتبة الوطنية بباريس. تجري الأن إضافة  مجموعات إضافية لزيادة تعزيز قاعدة البيانات كمورد وملف سلطة لتحديد المخطوطات.",
  "app.about.content.charles1": "تشارلز ستيوارت، محرر ({email})",
  "app.about.content.bruce1": "بروس ستيوارت هول، محرر عام ({email})",
  "app.about.content.bruceOrCharles": "أو",
  "app.search.dashboard.page.title": "الإعدادات",
  "app.page.help.title": "Help",
  "app.page.help.searching.records": "Searching records",
  "app.page.help.searching.authors": "Searching authors",
  "app.page.help.searching.subjects": "Searching subjects",
  "app.page.help.searching.nisbas": "Searching nisbas",
  "app.page.help.searching.titles": "Searching titles",
  "app.page.help.searching.dates": "Searching dates",
  "app.page.help.searching.aka": "Searching author known as",
  "app.page.help.back.to.search": "العودة إلى البحث",
  "app.page.history.title": "مشروع المخطوطات العربية فى غرب افريقيا",
  "app.page.history.subtitle": "A database of West African Arabic manuscript collections (formerly known as AMMS)",
  "app.page.history.p1": "The first version of this database (called “AMMS”) was created in 1987 as a finding aid for an Arabic manuscript microfilm project that preserved over 100,000 folios of material from the private library of Haroun o/ Sidiyya in Boutilimit, Mauritania. Our object then was to produce a bilingual hardcopy finding aid for that collection which consisted of diverse types of material from letters and notes to local histories and classical treatises in the Islamic sciences. Our goal was a simple and quick computer-generated entry system using un-transliterated Latin letters alongside Arabic entries that could be equally accessible to readers (and input specialists) using either Arabic or English. Our end product was to be a bilingual catalogue with indices that would be user-friendly in both languages. The original AMMS program was written using an early ARABDOS software to create 31 possible fields for entries about each manuscript and with an indexing capability to cross-reference and locate up to three fields in either language. Two years later the same software was employed to in-put a finding aid and generate indices for the Mauritanian national manuscript collection at the Institut Mauritanien de Recherche Scientifique. The possibility of expanding the number of entries to include other West African collections prompted a second version of AMMS, on the same platform, with the capability of merging files into a single database. Subsequently, in the early 1990s other published catalogues and hand-lists from West African collections housed in Niger, Paris, Timbuctu, and Evanston, Illinois were entered in the database. Taken together, over 19,000 records from these six collections were recorded in the AMMS vers.2 database, possibly a majority of the then-extant titles for the West African Sahel (excepting correspondence).",
  "app.page.history.p2": "The research potential of a union index of authors, nicknames, titles and subject matter in these collections of West Africa’s Arabic literary heritage, with the capability of expansion as other collections are uncovered, became obvious. AMMS provided us with a mechanism to re-unite a literary tradition represented by tens of thousands of Arabic documents across the West African Sahel that has been largely unknown beyond the work of a small band of local scholars and an even smaller cohort of Western-trained Arabists. Even where these materials were accessible to researchers in public repositories, the importance of this literary tradition has been well masked by the disparate systems used to record it and the dispersal of individual collections in Africa, Europe and North America.",
  "app.page.history.p3": "This project seeks to bring together, in a single database, a sizeable cross-section of these Arabic materials, despite sometimes imperfect annotation and documentation, to provide users with an index to roughly two hundred years of Sahelian literary activity. It was in the early 1990s that the work of editing over 19,000 entries for consistent orthography and subject identification foundered on the magnitude of that task, an increasingly fragile software platform, and difficulties in imagining how such an unwieldy end product might be disseminated. One positive result of my inattention to the project for nearly a decade is that these problems have now been largely resolved, thanks to advances in computer technology. In summer 2002 all of the 19,778 records were ported onto a Windows platform, the screen was redesigned, and, most significant, a search engine was created that overcame many of the previous difficulties that had arisen from the diversity of input parameters. The present internet version of the database has been rebuilt yet a third time to use a search engine accessible on the WEB. With this internet version, we have finally reunited a representative sweep West African Arabic writing and scholarship from pre-colonial times. During the decade this project was on hold, new finds of manuscripts in private libraries in Mauritania and Mali continued apace, and the numbers of additional manuscripts now catalogued from ‘new’ collections may well eclipse the number of initial entries in AMMSvers2; we welcome the addition of these new entries into the current database as a resource for future generations of scholarship.",
  "app.page.history.p4": "C.C. Stewart, General Editor \nUniversity of Illinois at Urbana-Champaign \nNovember 1, 2004",
  "app.page.history.subtitle2": "Acknowledgements",
  "app.page.history.p5": "In the more than ten years that this project has been maturing I have benefited from the advice and labors of a large number of friends and colleagues, none of whom are responsible for omissions and errors that will appear in a project of this magnitude. Baba o/ Haroun may have started this project by his request for help in preserving his father’s library in Boutilimit, Mauritania; Mamadou Niang, Andrew Stewart, and Atteya Elnoory all assisted with the input of that collection on the AMMS ver.1 that, with AMMS vers.2, was written by Kazumi Hatasa. Sid Ahmad b. Ahmad Salim, and Ahmad Ould Muhammad Yahya collaborated to input the Nouakchott collection and assisted with developing an early version of our subject-matter rubrics. These subject rubrics were subsequently refined by John Hunwick who also kindly offered to use the AMMS for the input of collections at Northwestern University.",
  "app.page.history.p6": "Mohammad Zouber gave us permission to photograph and input the hand-list in Timbuctu, and Raymond Taylor did that work. For the revival of this project I am deeply indebted to Jalal Al-Muhtadi who ported our data to its current Windows platform and wrote AMMS vers.3 with a new search engine that, effectively, has made it possible to place this database at the disposal of researchers at this time. Equally important has been the technical expertise of Robert Duff who re-wrote the search engine for internet access and has patiently ushered this project into world wide view. Fortuitously, Bruce Hall returned from his research in Timbuctu in 2002 in time to take on editing responsibilities for large portions of data that is now on-line and to input additional material (mainly from Niamey) to the database, and I am deeply indebted to his dedication to what has become our common project.",
  "app.page.history.p7": "Most recently (2008-9) I have benefited enormously from advice from Mohamed Drioueche at al-Furqan Foundation and the technical expertise of Dave Mak and Mohamed Ould Elbou.",
  "app.home.title": "مرحبا بكم في نظام إدارة المخطوطات العربية في غرب أفريقيا",
  "app.home.search.titles": "البحث في السجلات",
  "app.home.search.authors": "البحث في المؤلفين",
  "app.home.search.subjects": "البحث في المواضيع",
  "app.home.search.nisbas": "البحث في النسبة",
  "app.home.page.about": "What is WAAMD?",
  "app.signin.title": "تسجيل الدخول",
  "app.pages.not.found.text": "الصفحة غير موجودة:",
  "app.signup": "التسجيل",
  "app.shared.pagination.next": "التالي",
  "app.shared.pagination.prev": "السابق",
  "app.component.breadcrumb.home": "الرئيسية",
  "app.component.breadcrumb.collections": "المجموعات المتوفرة",
  "app.component.breadcrumb.history": "تاريخ المشروع",
  "app.component.breadcrumb.titles": "السجلات",
  "app.component.breadcrumb.dashboard": "الإعدادات",
  "app.component.breadcrumb.dashboard.xref": "الإحالات",
  "app.component.breadcrumb.dashboard.users": "Users",
  "app.component.breadcrumb.help": "Help",
  "app.menu.home": "الرئيسية",
  "app.menu.about": "حول",
  "app.menu.titles": "السجلات",
  "app.menu.subjects": "المواضيع",
  "app.menu.authors": "المؤلفون",
  "app.menu.collections": "المجموعات المتوفرة",
  "app.menu.history": "تاريخ المشروع",
  "app.menu.study": "دراسات",
  "app.menu.login": "الدخول",
  "app.menu.sign-up": "التسجيل",
  "app.menu.logout": "الخروج",
  "app.menu.users": "المستخدمون",
  "app.menu.logins": "Login History",
  "app.page.no.results.text": "عذرا، لم يتم العثور على نتائج.",
  "app.validation.error.required": "مطلوب",
  "app.validation.error.email.not.valid": "عنوان البريد الإلكتروني غير صالح.",
  "app.validation.error.passwords.do.not.match": "كلمات المرور غير متطابقة.",
  "app.validation.error.email.already.exists": "تم استخدام البريد الإلكتروني من قبل.",
  "app.components.result.info.text": "عرض {shownStart} إلى {shownEnd} من {total}",
  "app.component.see.also.see.also": "أنظر أيضا:",
  "app.component.see.also.see": "أنظر:",
  "app.component.see.also.includes": "يشمل:",
  "app.update.account.name.hint": "إدخال اسم.",
  "app.update.account.name.label": "اسمك الكامل",
  "app.update.account.email.hint": "you@example.com",
  "app.update.account.email.label": "بريدك الالكتروني",
  "app.update.account.pass.hint": "كلمة المرور الخاصة بك",
  "app.update.account.pass.label": "كلمة المرور",
  "app.update.account.re.pass.label": "إعادة إدخال كلمة المرور",
  "app.update.account.buttons.update": "تحديث معلومات الحساب",
  "app.update.account.buttons.cancel": "إلغاء",
  "app.search.authors.page.title": "المؤلفون",
  "app.page.collection.title": "المجموعات المتوفرة",
  "app.page.collection.p": "تشير الخريطة إلى التوزيع التقريبي لسجلات المخطوطة في كل مجموعة من المجموعات الموجودة في قاعدة البيانات هذه؛ انقر على اسم المجموعة لوصف المجموعة الفردية.",
  "app.dashboard.page.xrefs.title": "الإحالات",
  "app.dashboard.page.xrefs.add.new": "أضف إحالة جديدة",
  "app.name": "مشروع المخطوطات العربية فى غرب افريقيا",
  "app.header.page.home": "الرئيسية",
  "app.header.page.about": "حول",
  "app.header.page.collections": "المجموعات المتوفرة",
  "app.header.page.history": "تاريخ المشروع",
  "app.header.page.headings": "المواضيع",
  "app.header.page.search": "البحث",
  "app.header.page.search.titles": "البحث في السجلات",
  "app.header.page.search.authors": "البحث في المؤلفين",
  "app.header.page.search.subjects": "البحث في المواضيع",
  "app.header.page.search.nisbas": "البحث في النسبة",
  "app.header.page.dashboard": "الإعدادات",
  "app.header.page.account.info": "معلومات الحساب",
  "app.header.page.xref": "إحالات",
  "app.header.page.users": "المستخدمون",
  "app.header.page.login.activities": "أنشطة تسجيل الدخول",
  "app.header.page.logout": "الخروج",
  "app.header.page.login": "الدخول",
  "app.header.page.sign.up": "التسجيل",
  "app.header.language.ar": "Arabic",
  "app.header.language.ar.native": "العربية",
  "app.header.language.en": "الإنجليزية",
  "app.header.language.en.native": "English",
  "app.signin": "تسجيل الدخول",
  "app.signin.email.hint": "you@example.com",
  "app.signin.email.label": "بريدك الالكتروني",
  "app.signin.pass.hint": "كلمة المرور الخاصة بك",
  "app.signin.pass.label": "كلمة المرور",
  "app.signin.remember.me.label": "تذكرني",
  "app.signin.clear.form": "مسح النموذج",
  "app.titles.detail.title": "السجلات",
  "app.titles.detail.back.link": "العودة إلى البحث",
  "app.search.titles.page.title": "السجلات",
  "app.search.nisbas.page.title": "النسبة",
  "app.page.subject.heading.title": "المواضيع",
  "app.page.subject.heading.back.link": "العودة إلى المواضيع",
  "app.page.subject.heading.p1": "عناوين الموضوع أدناه وصفية لمحتوى المخطوطات الفردية كما تم تحديدها من قبل العديد من فهرسي هذه المجموعات. وبما أن هذه المكتبات إسلامية إلى حد كبير، فإن نظام تصنيف المخطوطات يعتمد أساسا على التخصصات / العلوم الإسلامية، ولكن أحيانا قد تظهر نفس المادة أو ما شابهها تحت أكثر من عنوان عام واحد، وفقا لأفضل حكم من فهرسين مختلفين. تظهر أدناه الإحالات المرجعية إلى القوائم الأكثر شيوعا أو الثلاثية لموضوع ما. وقد أضيفت ثلاثة مواضيع لا تظهر ضمن التخصصات الإسلامية: \"السياسة\" و \"الاقتصاد\" و \"المسائل الاجتماعية\" إلى حد كبير لإدماج المراسلات وغيرها من الكتابات التي تقع خارج العلوم الإسلامية.",
  "app.page.subject.heading.p2": "قوائم الموضوع أدناه ليست شاملة. ويشار إلى بعض الوصفات الأكثر تفصيلا للمخطوطات الفردية لتزويد المستخدمين مع فكرة عن مجموعة من المواد ضمن نماذج معينة. يظهر العدد التقريبي للسجلات في قاعدة البيانات لكل موضوع (اعتبارا من 6/08) بين قوسين بعد كل موضوع عام.",
  "app.page.subject.heading.p3": "انقر على عناوين الموضوعات للحصول على قائمة مفصلة بالمواضيع الفرعية.",
  "app.page.subject.heading.p4": "انقر فوق عنوان موضوع في أي من اللغات لبدء البحث عنه في قاعدة البيانات.",
  "app.page.subject.heading.h31": "عناوين عامة (و العدد التقريبي لكل منها)",
  "app.page.subject.heading.h32": "إحالات",
  "app.page.form.search.buttons.search": "البحث",
  "app.page.form.search.buttons.clear": "مسح النموذج",
  "app.page.form.search.buttons.basic.search": "البحث الأساسي",
  "app.page.form.search.buttons.advanced.search": "البحث المتقدم",
  "app.search.label.keyword": "إدخال كلمة بحث بالأحرف اللاتينية أو العربية",
  "app.search.label.select": "حدد الحقل",
  "app.search.label.choose": "أختر...",
  "app.search.label.select.collection": "حدد مجموعة",
  "app.search.label.title": "إدخال عنوان أو كلمة (كلمات) من العنوان باللغة العربية",
  "app.search.label.subject": "إدخال الموضوع بالأحرف اللاتينية أو العربية",
  "app.search.label.author": "إدخال اسم المؤلف بالأحرف اللاتينية أو العربية",
  "app.search.label.aka": "إدخال اسم الشهرة بالأحرف اللاتينية أو العربية",
  "app.search.label.nisba": "إدخال النسبة بالأحرف اللاتينية أو العربية",
  "app.search.label.died_date": "إدخال تاريخ الوفاة",
  "app.search.label.collection": "أدخل المجموعة",
  "app.search.label.collectionNumber": "أدخل رقم المجموعة",
  "app.search.field.title": "العنوان",
  "app.search.field.subject": "الموضوع",
  "app.search.field.author": "المؤلف",
  "app.search.field.aka": "اسم الشهرة",
  "app.search.field.nisba": "النسبة",
  "app.search.field.died_date": "تاريخ الوفاة",
  "app.search.field.collection": "المجموعة",
  "app.search.field.collectionNumber": "رقم المجموعة",
  "app.search.field.any": "أي حقل",
  "app.signup.form.title": "التسجيل",
  "app.signup.name.hint": "أدخل أسمك.",
  "app.signup.name.label": "اسمك الكامل",
  "app.signup.email.hint": "email@example.com",
  "app.signup.email.label": "بريدك الالكتروني",
  "app.signup.pass.hint": "كلمة المرور الخاصة بك",
  "app.signup.pass.label": "كلمة المرور",
  "app.sign.up.success.message": "شكرا، لقد سجلت بنجاح، وسوف يكون  بإمكانك الدخول بعد أن تتم الموافقة على حسابك.",
  "app.signup.clear.form": "مسح النموذج",
  "app.page.form.simple.search.buttons.clear": "مسح البحث",
  "app.page.form.simple.search.buttons.search": "البحث",
  "app.page.form.simple.search.label.generic": "أدخل كلمة بحث بالأحرف اللاتينية أو العربية",
  "app.page.form.simple.search.label.author": "إدخال اسم المؤلف بالأحرف اللاتينية أو العربية",
  "app.page.form.simple.search.label.subject": "إدخال الموضوع بالأحرف اللاتينية أو العربية",
  "app.page.form.simple.search.label.nisba": "إدخال النسبة بالأحرف اللاتينية أو العربية",
  "app.search.subjects.page.title": "المواضيع",
  "app.dashboard.page.update.account.title": "تحديث معلومات الحساب"
}