{
  "app.tools.arabic.keyboard.title": "Arabic keyboard",
  "app.tools.arabic.keyboard.done": "Done",
  "app.tools.arabic.keyboard.placeholder": "Click on a letter to add it here",
  "app.tools.arabic.keyboard.space": "space",
  "app.help.link.label": "Help",
  "app.titles.gist.see.full.record": "see full record",
  "app.about.page.title": "What is WAAMD?",
  "app.about.title": "What is WAAMD (formerly AMMS)?",
  "app.about.subtitle": "[The West African Arabic Manuscript Database]",
  "app.about.content.p2": "The database software was re-written in 2017/18 and is now comprised of five interactive data sets: the manuscript records, their authors, the authors’ nisbas, subjects, and the collections themselves. It has a search engine designed to identify manuscripts and authors when only fragmentary information is available, in Arabic or Latin characters or a combination of both. Where digital images of manuscript texts are available, url links to the images appear in the records.",
  "app.about.content.p4": "Funding for the development and elaboration of AMMS, now WAAMD, began with support from the National Endowment for the Humanities in 1991 and has since received support from the University of Illinois at Urbana-Champaign, The Johns Hopkins University, Duke University, al-Furqan Islamic Heritage Foundation, and the University of California at Berkeley. For more information contact:",
  "app.about.content.charles2": "Department of History, University of Illinois at Urbana-Champaign, and Institute for the Study of Islamic Thought in Africa, Northwestern University",
  "app.about.content.bruce2": "Department of History, University of California, Berkeley",
  "app.about.content.bruceOrCharles": "Or",
  "app.about.content.p1": "WAAMD is a bi-lingual database that was developed at the University of Illinois in the late 1980s to describe a collection of Arabic manuscripts in southern Mauritania (Boutilimit). It subsequently has been used to compile a union catalogue of other West African collections, including manuscript libraries in West Africa, Europe and the United States. Beginning in 2018 inventories from the SAVAMA-DCI project in Timbuktu {timbuktu} are being added. This is a work in progress that will be expanding as additional library data from West Africa is being made available. WAAMD is hosted by the Library of the University of California, Berkeley.",
  "app.about.content.p3": "The database is publicly available at no cost to users; and the WAAMD cataloguing app is free to be downloaded for local use. Thirty-odd fields in Arabic and English cover all the descriptors normally employed in manuscript work and users may customize the input fields for the needs of particular collections. We encourage the inclusion of newly-catalogued material into the main database and ask readers to contact the editors to help facilitate this.",
  "app.about.content.charles1": "Charles Stewart, Editor ({email})",
  "app.about.content.bruce1": "Bruce Stewart Hall, General Editor ({email})",
  "app.search.dashboard.page.title": "Dashboard",
  "app.page.field.help.title": "Searching for authors and subjects (and other fields) in AMMS records",
  "app.page.field.help.searching.records": "Searching records",
  "app.page.field.help.searching.authors": "Searching authors",
  "app.page.field.help.searching.subjects": "Searching subjects",
  "app.page.field.help.searching.nisbas": "Searching nisbas",
  "app.page.field.help.searching.titles": "Searching titles",
  "app.page.field.help.searching.dates": "Searching dates",
  "app.page.field.help.searching.aka": "Searching author known as",
  "app.page.field.help.back.to.home": "back to home",
  "app.page.help.title": "Help",
  "app.page.help.searching.records": "Searching records",
  "app.page.help.searching.authors": "Searching authors",
  "app.page.help.searching.subjects": "Searching subjects",
  "app.page.help.searching.nisbas": "Searching nisbas",
  "app.page.help.searching.titles": "Searching titles",
  "app.page.help.searching.dates": "Searching dates",
  "app.page.help.searching.aka": "Searching author known as",
  "app.page.help.back.to.search": "back to search",
  "app.page.history.title": "West African Arabic Manuscript Database",
  "app.page.history.subtitle": "A database/union catalogue of West African Arabic manuscripts (formerly known as AMMS)",
  "app.page.history.p1": "The first version of this database  (“AMMS” for the Arabic Manuscript Management System) was written in 1987 as a finding aid for an Arabic manuscript microfilm project, funded by N.E.H.,  that preserved over 100,000 folios of material from the private library of Haroun o/ Sidiyya in Boutilimit, Mauritania. Our object then was to produce a bilingual hardcopy finding aid for that collection which consisted of diverse types of material from letters and notes to local histories and classical treatises in the Islamic sciences. Our goal was a simple and quick computer-generated entry system using un-transliterated Latin letters alongside Arabic entries.  We sought records that could be equally accessible to readers (and input specialists) using either Arabic or English. Our end-product was to be a bilingual catalogue with indices that would be user-friendly in both languages. The original AMMS program was written by Kazumi Hatasa using an early ARABDOS software to create 31 possible fields for entries about each manuscript (16 in Arabic, 15 in English – titles were not transliterated into Latin characters) and with an indexing capability to cross-reference and locate up to three fields in either language.",
  "app.page.history.p2": "Two years later the same software was employed to in-put a finding aid and generate indices for the Mauritanian national manuscript collection at the Institut Mauritanien de Recherche Scientifique. The possibility of expanding the number of entries still further, to include other West African collections, prompted a second version of AMMS, on the same platform, with the capability of merging records of different collections into a single database.",
  "app.page.history.p3": "Subsequently, in the early 1990s other published catalogues and hand-lists from West African collections housed in Niger, Paris, Timbuktu, and Evanston, Illinois were entered in the database. Taken together, over 19,000 records from these six collections were recorded in the AMMS vers.2 database.",
  "app.page.history.p4": "The research potential of a union index of authors, nicknames, titles and subject matter in these collections of West Africa’s Arabic literary heritage, with the capability of expansion as other collections are uncovered, became obvious. AMMS presented us with a mechanism to re-unite a literary tradition represented by tens of thousands of Arabic documents across the West African Sahel.  This is a literature that has been largely unknown to the outside world beyond the work of a small band of local scholars and an even smaller cohort of Arabists. Even where these materials were accessible to researchers in public repositories, the importance of this literary tradition was well masked by the disparate systems used to record it and the dispersal of individual collections in Africa, Europe and North America.",
  "app.page.history.p5": "This project seeks to bring together, in a single database, a sizeable cross-section of these Arabic materials. Input has frequently depended upon the accuracy and inclinations of other cataloguers whose work has been incorporated, and manuscript annotation and documentation is thus uneven across records from different sources. However, this compilation does provide users with an index to roughly three- hundred years of Saharan and Sahelian literary activity.",
  "app.page.history.p6": "In the early 1990s the project of editing over 19,000 entries for consistent orthography and subject identification foundered on the magnitude of that task, an increasingly outdated and fragile software platform, and difficulties in imagining how such an unwieldy end-product might be disseminated. One positive result of my inattention to the project during the 1990s is that many of these problems were largely resolved during that period by advances in computer technology.",
  "app.page.history.p7": "In summer 2002 all 19,778 records were ported onto a Windows platform, the screen was redesigned, and, most significant, a search engine was created that overcame many of the previous difficulties that had arisen from the diversity of input parameters. This third reconstruction of the database software was accomplished by Jalal al-Muhtadi who, with Robert Duff, made possible the first on-line version of AMMS, as an open-access resource for West African Arabic manuscripts in 2004.",
  "app.page.history.p8": "During the 1990s new finds of manuscripts in private libraries in Mauritania and Mali continued apace, and the numbers of additional manuscripts now catalogued from ‘new’ collections well eclipse the number of initial entries. It is our hope to incorporate newly catalogued collections as their editors make them available. Under an agreement with al-Furqan Islamic Heritage Foundation in 2008 we began entering catalogues of West African libraries that were published by the foundation, and that project continues.",
  "app.page.history.p9": "AMMS yet again suffered a hiatus of attention during the decade after it was put on-line while I was preoccupied with the Arabic Literature of Africa vol V (Brill, 2015). In summer 2017 the software, some parts dating back 25 years, was entirely re-written by Mohamed Ali Elbou (AMMS vers. 4) and the data made into a relational database.  AMMS was re-named as the West African Arabic Manuscript Database (WAAMD).  This work was funded in part by Duke University research funds provided by Bruce Hall and subsequently by the University of California, Berkeley, Library.  In the summer of 2018 the database was transferred to the Berkeley Library and, with its updated software, new records to be added more rapidly than was formerly possible.  Also, in 2018, the author information from the Arabic Literature of Africa volume 5 (Mauritania and the western Sahara) was added and collaboration began with the SAVAMA-DCI Project at Hamburg University’s Center for the Study of Manuscript Cultures, to publish their inventories of Timbuktu libraries, with digital image links to the Hill Museum and Manuscript Library digitization project in Timbuktu.",
  "app.page.history.p10": "C.C. Stewart, General Editor (1998-2018)",
  "app.page.history.subtitle2": "Acknowledgements",
  "app.page.history.p13": "In the more than twenty-five years that this project has been maturing I have benefited from the advice and labors of a large number of friends and colleagues, none of whom are responsible for omissions and errors that will appear in a project of this magnitude. Baba o/ Haroun may have started this project by his request for help in preserving his father’s library in Boutilimit, Mauritania in 1986; Mamadou Niang, Andrew Stewart, and Atteya Elnoory all assisted with the input of that collection on the AMMS ver.1 that, with AMMS vers.2, was written by Kazumi Hatasa. Sidi Ahmad b. Ahmad Salim, and Ahmad Ould Muhammad Yahya collaborated to input the Nouakchott collection and assisted with developing an early version of our subject-matter rubrics in 1989. These subject rubrics were subsequently refined by John Hunwick who also kindly offered to use the AMMS for the input of collections at Northwestern University.",
  "app.page.history.p14": "Mohammad Zouber gave us permission to photograph and input the hand-list in Timbuktu, and Raymond Taylor did that work. For the revival of this project I am deeply indebted to Jalal al-Muhtadi who ported our data to its current Windows platform and wrote AMMS vers.3 with a new search engine that, effectively, has made it possible to place this database at the disposal of researchers. Equally important has been the technical expertise of Robert Duff who re-wrote the search engine for internet access and has patiently ushered this project into world wide view. Fortuitously, Bruce Hall returned from his research in Timbuktu in 2002 in time to take on some of the editing responsibilities for large portions of data that is now on-line and to input additional material (mainly from Niamey) in the database, and I am deeply indebted to his dedication to what has become our common project. Most recently (2008-9) I have benefited enormously from advice from Mohamed Drioueche at al-Furqan Foundation and the technical expertise of Dave Mak.  Since 2009 Mohamed Ali Elbou has been the main IT support for this project; it is he who has repaired problems on the out-dated software and, most importantly, authored a complete re-write of the AMMS platform in 2017.",
  "app.home.title": "Welcome to the West African Arabic Manuscript Database (WAAMD)",
  "app.home.lead": "A database/union catalogue of Arabic and Arabic-script writing from West Africa",
  "app.home.search.titles": "Search records",
  "app.search.titles.page.blurb": "Use “any field” for searches of names or other information that may appear in the ‘Miscellaneous’ field or any of the fields not specified in the box below; `ain, hamza and transliteration symbols are not necessary in keywords.",
  "app.home.search.authors": "Search authors",
  "app.search.authors.page.blurb": "Consult the “Searching for Authors and Subjects” tab on the homepage for help; `ain, hamza and transliteration symbols are not necessary in keywords.",
  "app.home.search.subjects": "Search subjects",
  "app.search.subjects.page.blurb": "If unsure about keywords, go to “Subject Headings” tab at the top of this screen for a complete list of subjects; a subject search can also be initiated from there.",
  "app.home.search.nisbas": "Search nisbas",
  "app.search.nisbas.page.blurb": "Searching for tribal, residential or ethnic tags frequently found in personal names",
  "app.home.page.about": "What is WAAMD?",
  "app.home.page.collections": "Manuscript Collections included",
  "app.home.page.history": "History of the project",
  "app.home.page.entry.form": "See the AMMS data input form and download for your own use",
  "app.home.page.titles.and.subjects.search": "Searching for authors and subjects",
  "app.signin.title": "Sign In",
  "app.pages.not.found.text": "Page not found:",
  "app.signup": "Sign Up",
  "app.shared.pagination.next": "next",
  "app.shared.pagination.prev": "previous",
  "app.component.breadcrumb.home": "Home",
  "app.component.breadcrumb.collections": "Manuscript Collections included",
  "app.component.breadcrumb.history": "History",
  "app.component.breadcrumb.titles": "Records",
  "app.component.breadcrumb.dashboard": "Dashboard",
  "app.component.breadcrumb.dashboard.xref": "X-references",
  "app.component.breadcrumb.dashboard.users": "Users",
  "app.component.breadcrumb.help": "Help",
  "app.menu.home": "Home Page",
  "app.menu.about": "About",
  "app.menu.titles": "Records",
  "app.menu.subjects": "Subjects",
  "app.menu.authors": "Authors",
  "app.menu.collections": "Collections",
  "app.menu.history": "History",
  "app.menu.study": "Study",
  "app.menu.login": "Login",
  "app.menu.sign-up": "Sign Up",
  "app.menu.logout": "Logout",
  "app.menu.users": "Users",
  "app.menu.logins": "Login History",
  "app.page.no.results.text": "Sorry, no results found.",
  "app.validation.error.required": "Required",
  "app.validation.error.email.not.valid": "Invalid e-mail address.",
  "app.validation.error.passwords.do.not.match": "Passwords don't match.",
  "app.validation.error.email.already.exists": "E-mail already used.",
  "app.components.result.info.text": "Showing {shownStart} to {shownEnd} of {total}",
  "app.component.see.also.see.also": "see also:",
  "app.component.see.also.see": "see:",
  "app.component.see.also.includes": "includes:",
  "app.update.account.name.hint": "Enter a name.",
  "app.update.account.name.label": "Your full name",
  "app.update.account.email.hint": "you@example.com",
  "app.update.account.email.label": "Your e-mail",
  "app.update.account.pass.hint": "your password",
  "app.update.account.pass.label": "Password",
  "app.update.account.re.pass.label": "Re-enter password",
  "app.update.account.buttons.update": "Update account info",
  "app.update.account.buttons.cancel": "Cancel",
  "app.authors.detail.title": "Authors",
  "app.authors.detail.back.link": "back to search",
  "app.authors.detail.sure.delete": "Are you sure you want to delete this author?",
  "app.authors.detail.sure.delete.title": "Are you sure?",
  "app.authors.detail.find.records": "find records",
  "app.authors.detail.delete.success.message": "Success! the author, {name}, was deleted.",
  "app.search.authors.page.title": "Authors",
  "app.authors.add.title": "New author",
  "app.authors.add.back.link": "back to search",
  "app.authors.add.success.message": "Success! a new author was added, click the link to see it: {link}",
  "app.authors.add.form.add": "save",
  "app.authors.add.form.cancel": "cancel",
  "app.authors.edit.title": "Edit author",
  "app.authors.edit.back.link": "back to search",
  "app.authors.edit.success.message": "Success! a new author was updated, click the link to see it: {link}",
  "app.page.collection.title": "Manuscript Collections included",
  "app.page.collection.p": "For details about these collections click on the map site or the name above.",
  "app.dashboard.page.xrefs.title": "X-references",
  "app.dashboard.page.xrefs.add.new": "Add a new x-reference",
  "app.name": "West African Arabic Manuscript Project",
  "app.header.page.home": "Home",
  "app.header.page.about": "About",
  "app.header.page.collections": "Collections",
  "app.header.page.history": "History",
  "app.header.page.headings": "Subject Headings",
  "app.header.page.search": "Search",
  "app.header.page.search.titles": "Search records",
  "app.header.page.search.authors": "Search authors",
  "app.header.page.search.subjects": "Search subjects",
  "app.header.page.search.nisbas": "Search nisbas",
  "app.header.page.dashboard": "Dashboard",
  "app.header.page.account.info": "Account info",
  "app.header.page.xref": "X-references",
  "app.header.page.users": "Users",
  "app.header.page.login.activities": "Login activities",
  "app.header.page.logout": "Logout",
  "app.header.page.login": "Login",
  "app.header.page.sign.up": "Sign up",
  "app.header.language.ar": "Arabic",
  "app.header.language.ar.native": "العربية",
  "app.header.language.en": "English",
  "app.header.language.en.native": "English",
  "app.signin": "sign in",
  "app.signin.email.hint": "you@example.com",
  "app.signin.email.label": "Your e-mail",
  "app.signin.pass.hint": "your password",
  "app.signin.pass.label": "Password",
  "app.signin.remember.me.label": "Remember me",
  "app.signin.clear.form": "clear form",
  "app.titles.detail.title": "Records",
  "app.titles.detail.back.link": "back to search",
  "app.titles.detail.sure.delete": "Are you sure you want to delete this record?",
  "app.titles.detail.sure.delete.title": "Are you sure?",
  "app.titles.detail.delete.success.message": "Success! the record, {title}, was deleted.",
  "app.search.titles.page.title": "Records",
  "app.nisbas.detail.title": "Nisbas",
  "app.nisbas.detail.back.link": "back to search",
  "app.nisbas.detail.sure.delete": "Are you sure you want to delete this nisba?",
  "app.nisbas.detail.sure.delete.title": "Are you sure?",
  "app.nisbas.detail.find.authors": "find authors",
  "app.nisbas.detail.delete.success.message": "Success! the nisba, {name}, was deleted.",
  "app.search.nisbas.page.title": "Nisbas",
  "app.nisbas.add.title": "New nisba",
  "app.nisbas.add.back.link": "back to search",
  "app.nisbas.add.success.message": "Success! a new nisba was added, click the link to see it: {link}",
  "app.nisbas.edit.title": "Edit nisba",
  "app.nisbas.edit.back.link": "back to search",
  "app.nisbas.edit.success.message": "Success! a new nisba was updated, click the link to see it: {link}",
  "app.nisbas.add.form.add": "save",
  "app.nisbas.add.form.cancel": "cancel",
  "app.page.subject.heading.title": "Subject Rubrics",
  "app.page.subject.heading.back.link": "back to subject headings",
  "app.page.subject.heading.p1": "The subject headings below are descriptive of the content of individual manuscripts as identified by the several catalogers of these collections. Since these are largely Islamic libraries our manuscript classification system is mainly based on the Islamic disciplines/sciences, but occasionally the same or similar material may appear under more than one broad rubric, following the best judgment of different catalogers. Cross-references to the most common double or triple listings of a subject appear below. Three topics that would not appear among the Islamic disciplines have been added: \"politics,\" \"economy\" and \"social matters\" largely to incorporate correspondence and other writings that fall outside the Islamic sciences.",
  "app.page.subject.heading.p2": "The subject lists below are not comprehensive. Some of the more detailed descriptors for individual manuscripts are indicated to provide users with an idea of the range of material within particular rubrics. The approximate number of records in the database for each subject (as of 6/08) appears in parentheses following each general subject.",
  "app.page.subject.heading.p3": "Click on subject headings for a detailed listing of sub-topics.",
  "app.page.subject.heading.p4": "Click on a subject heading in either language to begin a search for it in the database.",
  "app.page.subject.heading.h31": "General Rubrics (and approx. record numbers in each)",
  "app.page.subject.heading.h32": "Cross Reference",
  "app.titles.add.title": "New record",
  "app.titles.add.back.link": "back to search",
  "app.titles.add.success.message": "Success! a new record was added, click the link to see it: {link}",
  "app.titles.edit.title": "Edit record",
  "app.titles.edit.back.link": "back to search",
  "app.titles.edit.success.message": "Success! a new record was updated, click the link to see it: {link}",
  "app.titles.add.form.add": "save",
  "app.titles.add.form.cancel": "cancel",
  "app.page.form.search.buttons.search": "search",
  "app.page.form.search.buttons.clear": "clear search",
  "app.page.form.search.buttons.basic.search": "basic search",
  "app.page.form.search.buttons.advanced.search": "advanced search",
  "app.search.label.default": "enter a search keyword in Latin characters or Arabic",
  "app.search.label.keyword": "enter a search keyword",
  "app.search.label.select": "select field",
  "app.search.label.choose": "choose...",
  "app.search.label.select.collection": "select collection",
  "app.search.label.title": "enter title or word(s) from the title in Arabic",
  "app.search.label.subject": "enter subject in Latin characters or Arabic",
  "app.search.label.subject.id": "enter subject id",
  "app.search.label.author": "enter author name or part of the name in Latin characters or Arabic",
  "app.search.label.author.id": "enter author id",
  "app.search.label.aka": "enter author's familiar name in Latin characters or Arabic",
  "app.search.label.nisba": "enter author's tribal or residential or ethnic name (nisba) in Latin characters or Arabic",
  "app.search.label.nisba.id": "enter nisba id",
  "app.search.label.died_date": "enter date deceased, A.H. or C.E.",
  "app.search.label.collection": "enter collection",
  "app.search.label.collectionNumber": "enter collection number",
  "app.search.field.title": "title",
  "app.search.field.subject": "subject",
  "app.search.field.subject.id": "subject id",
  "app.search.field.author": "author",
  "app.search.field.author.id": "author id",
  "app.search.field.aka": "author known as",
  "app.search.field.nisba": "author nisba",
  "app.search.field.nisba.id": "author nisba id",
  "app.search.field.died_date": "author death date",
  "app.search.field.collection": "collection",
  "app.search.field.collectionNumber": "collection #",
  "app.search.field.any": "any field",
  "app.signup.form.title": "sign up",
  "app.signup.name.hint": "Enter your name.",
  "app.signup.name.label": "Your full name",
  "app.signup.email.hint": "you@example.com",
  "app.signup.email.label": "Your e-mail",
  "app.signup.pass.hint": "your password",
  "app.signup.pass.label": "Password",
  "app.sign.up.success.message": "Thanks, You registered successfully, and will be able to login once your account has been approved.",
  "app.signup.clear.form": "clear form",
  "app.page.form.simple.search.buttons.clear": "clear search",
  "app.page.form.simple.search.buttons.search": "search",
  "app.page.form.simple.search.label.generic": "enter a keyword",
  "app.page.form.simple.search.label.author": "enter author name or part of the name in Latin characters or Arabic",
  "app.page.form.simple.search.label.subject": "enter subject in Latin characters or Arabic",
  "app.page.form.simple.search.label.nisba": "enter author's tribal or residential or ethnic name (nisba) in Latin characters or Arabic",
  "app.page.form.simple.search.select": "select field",
  "app.page.form.simple.search.select.any.field": "any field",
  "app.page.form.simple.search.select.name": "author name",
  "app.page.form.simple.search.select.author.id": "author id",
  "app.page.form.simple.search.select.author.aka": "author known as",
  "app.page.form.simple.search.select.author.nisba": "author nisba",
  "app.page.form.simple.search.select.author.nisba.id": "author nisba id",
  "app.page.form.simple.search.select.author.date_died": "author death date",
  "app.subjects.detail.title": "Subjects",
  "app.subjects.detail.back.link": "back to search",
  "app.subjects.detail.sure.delete": "Are you sure you want to delete this subject?",
  "app.subjects.detail.sure.delete.title": "Are you sure?",
  "app.subjects.detail.find.records": "find records",
  "app.subjects.detail.delete.success.message": "Success! the subject, {name}, was deleted.",
  "app.search.subjects.page.title": "Subjects",
  "app.subjects.add.title": "New subject",
  "app.subjects.add.back.link": "back to search",
  "app.subjects.add.success.message": "Success! a new subject was added, click the link to see it: {link}",
  "app.subjects.edit.title": "Edit subject",
  "app.subjects.edit.back.link": "back to search",
  "app.subjects.edit.success.message": "Success! a new subject was updated, click the link to see it: {link}",
  "app.subjects.add.form.add": "save",
  "app.subjects.add.form.cancel": "cancel",
  "app.dashboard.page.update.account.title": "Update account info"
}